<?php
	echo M_PI."<br />".M_E."<br />";// математические константы
	
	$x = -15;
	
	echo abs($x)."<br />";//модуль
	$y = 49.3458234;
	echo round ($y, 3)."<br />";//округляет
	echo ceil ($y)."<br />";// округляет к большему
	echo floor ($y)."<br />";// округляет к меньшему
	
	echo mt_rand(1, 20)."<br />";//рандомное число
	echo min(12, 23, -2, -5, 19, -4, 0)."<br />";	//показывает минимальное значение
	echo max(12, 23, -2, -5, 19, -4, 0)."<br />";
	
	$z = 1;
	
	echo sin($z)."<br />";
	echo asin($z)."<br />";
?>
